//1 Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
/*let name = prompt(`Привіт введіть ваше ім'я`,'Jack');
alert(`Привіт  ${name}`);
*/

//2 Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
/*
const currentYear = 2024;
let birthYear = prompt('Enter your birth year', 1991);

let age = currentYear - birthYear;

alert(`Your age - ${age} years old`);*/

//3 Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата
/*
let side = prompt('Введіть довжину сторони квадрата');

let answer = side*4;

alert(`Периметр квадрата буде дорівнювати - ${answer}`)*/
//1  Запитай у користувача радіус кола і виведи площу такої окружності.        S = πr2, де π = 3,14, r – радіус круга.
/*
let rad = prompt(`Введіть радіус кола`);

let square = 3.14*rad*2;
let num = square.toFixed(1);
alert(`Площу окружності - ${num}`);*/

//2 Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.
/*let distance = prompt(`Введіть відстань в кілометрах`);
let time = prompt(`За скільки годин ви хочете дістатися?`);
let answer = distance/time;
let num = answer.toFixed(1);
alert(`Потрібно рухатися зі швидкістю - ${num}`)*/
//3 Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.
// const dollar = 40;
// const euro = 1.08;

// let value = prompt('Please enter the number');

// let answer = value * euro;

// alert( `In euros - ${answer}`);